src/cf/InformationRegisters/ИсторияРаботыПродавцов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ИсторияРаботыПродавцов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>PIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Продолжительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Продавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСеанса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПользователей</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НастройкиПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ПериодическиеСвойстваМагазинов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПериодическиеСвойстваМагазинов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВремяНачалаРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяОкончанияРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ИсторияРаботыПродавцов/Ext/ManagerModule.bsl
// Получаем таблицу незавершенных сеансов текущего магазина 
Функция ПолучитьТаблицуНезавершенныхСеансовПродавцов(Пользователь) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИсторияРаботыПродавцов.Период,
		|	ИсторияРаботыПродавцов.Пользователь,
		|	ИсторияРаботыПродавцов.Продавец,
		|	ИсторияРаботыПродавцов.НомерСеанса,
		|	ИсторияРаботыПродавцов.ДатаНачала,
		|	НастройкиПользователей.Значение КАК ОсновнойСклад,
		|	ЕСТЬNULL(ПериодическиеСвойстваМагазинов.ВремяНачалаРаботы, ДАТАВРЕМЯ(1, 1, 1, 10, 0, 0)) КАК ВремяНачалаРаботы,
		|	РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), ЕСТЬNULL(ПериодическиеСвойстваМагазинов.ВремяНачалаРаботы, ДАТАВРЕМЯ(1, 1, 1, 10, 0, 0)), СЕКУНДА) КАК ВремяНачалаРаботыВСекундах,
		|	ЕСТЬNULL(ПериодическиеСвойстваМагазинов.ВремяОкончанияРаботы, ДАТАВРЕМЯ(1, 1, 1, 22, 0, 0)) КАК ВремяОкончанияРаботы,
		|	РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), ЕСТЬNULL(ПериодическиеСвойстваМагазинов.ВремяОкончанияРаботы, ДАТАВРЕМЯ(1, 1, 1, 22, 0, 0)), СЕКУНДА) КАК ВремяОкончанияРаботыВСекундах
		|ИЗ
		|	РегистрСведений.ИсторияРаботыПродавцов КАК ИсторияРаботыПродавцов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
		|		ПО ИсторияРаботыПродавцов.Пользователь = НастройкиПользователей.Пользователь
		|			И (НастройкиПользователей.Пользователь = &НастройкаОсновнойСклад)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПериодическиеСвойстваМагазинов КАК ПериодическиеСвойстваМагазинов
		|		ПО (НастройкиПользователей.Значение = ПериодическиеСвойстваМагазинов.Магазин)
		|ГДЕ
		|	ИсторияРаботыПродавцов.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|	И ИсторияРаботыПродавцов.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("НастройкаОсновнойСклад", ПланыВидовХарактеристик.НастройкиПользователей.ОсновнойСклад);
	
	РезультатЗапроса = Запрос.Выполнить();	

	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции
